In [1]:
from MySQLdb import connect
import pandas as pd

/var/folders/fb/xl0hnskx527bfqkv38l3sn7h0000gn/T/ipykernel_12745/3687392072.py:2: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
# Connect to your MySQLdb
#conn = connect(host='localhost', user='root')
conn = connect(host='127.0.0.1', user='root', password = 'root', port = 8890)

In [3]:
# Open a cursor to perform database operations
cur = conn.cursor()

In [4]:
# Return data from the Customers table:
cur.execute('''SHOW DATABASES;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

             Database
0  information_schema
1               mysql
2  performance_schema
3              sqlw3s
4                 sys
5              testDB

### SQL PRIMARY KEY Constraint
The PRIMARY KEY constraint uniquely identifies each record in a table.

Primary keys must contain UNIQUE values, and cannot contain NULL values.

A table can have only ONE primary key; and in the table, this primary key can consist of single or multiple columns (fields).

SQL PRIMARY KEY on CREATE TABLE

In [8]:
cur.execute('''DROP TABLE testDB.Persons;''')

0

In [10]:
# The following SQL creates a PRIMARY KEY on the "ID" column when the "Persons" table is created:
cur.execute('''CREATE TABLE testDB.Persons (
    ID int NOT NULL,
    LastName varchar(255) NOT NULL,
    FirstName varchar(255),
    Age int,
    PRIMARY KEY (ID)
);''')

0

SQL Server / Oracle / MS Access:

CREATE TABLE Persons (
    ID int NOT NULL PRIMARY KEY,
    LastName varchar(255) NOT NULL,
    FirstName varchar(255),
    Age int
);

In [11]:
cur.execute('''DROP TABLE testDB.Persons;''')

0

In [12]:
# To allow naming of a PRIMARY KEY constraint, and for defining a PRIMARY KEY constraint on multiple columns, use the following SQL syntax:
cur.execute('''CREATE TABLE testDB.Persons (
    ID int NOT NULL,
    LastName varchar(255) NOT NULL,
    FirstName varchar(255),
    Age int,
    CONSTRAINT PK_Person PRIMARY KEY (ID,LastName)
);''')

0

Note: In the example above there is only ONE PRIMARY KEY (PK_Person). However, the VALUE of the primary key is made up of TWO COLUMNS (ID + LastName).


- SQL PRIMARY KEY on ALTER TABLE
To create a PRIMARY KEY constraint on the "ID" column when the table is already created, use the following SQL:

MySQL / SQL Server / Oracle / MS Access:

ALTER TABLE Persons
ADD PRIMARY KEY (ID);
To allow naming of a PRIMARY KEY constraint, and for defining a PRIMARY KEY constraint on multiple columns, use the following SQL syntax:

MySQL / SQL Server / Oracle / MS Access:

ALTER TABLE Persons
ADD CONSTRAINT PK_Person PRIMARY KEY (ID,LastName);
Note: If you use ALTER TABLE to add a primary key, the primary key column(s) must have been declared to not contain NULL values (when the table was first created).

DROP a PRIMARY KEY Constraint
To drop a PRIMARY KEY constraint, use the following SQL:

MySQL:

ALTER TABLE Persons
DROP PRIMARY KEY;
SQL Server / Oracle / MS Access:

ALTER TABLE Persons
DROP CONSTRAINT PK_Person;

--postgre
ALTER TABLE public.bill7 ADD PRIMARY KEY (id, moje);
ALTER TABLE public.bill7 DROP CONSTRAINT bill7_pkey;

In [20]:
cur.execute('''DROP TABLE testDB.Persons;''')

0

In [21]:
cur.execute('''CREATE TABLE testDB.Persons (
    ID int NOT NULL,
    LastName varchar(255) NOT NULL,
    FirstName varchar(255),
    Age int
);''')

0

In [22]:
# In MySQL, nullability is a part of the datatype, not a constraint. So:
cur.execute('''ALTER TABLE testDB.Persons ADD PRIMARY KEY (ID)''')

0

In [23]:
# Return data from the CustomersNew table:
cur.execute('''SELECT * FROM testDB.Persons;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
columns = [i[0] for i in cur.description]
if len(df) == 0: df = pd.DataFrame([["" for i in range(len(columns))]])
df.columns = columns
df

  ID LastName FirstName Age
0

In [24]:
# Return data from the Customers table:
cur.execute('''DESCRIBE testDB.Persons;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
columns = [i[0] for i in cur.description]
if len(df) == 0: df = pd.DataFrame([["" for i in range(len(columns))]])
df.columns = columns
df

       Field          Type Null  Key Default Extra
0         ID       int(11)   NO  PRI    None
1   LastName  varchar(255)   NO         None
2  FirstName  varchar(255)  YES         None
3        Age       int(11)  YES         None

In [26]:
cur.execute('''ALTER TABLE testDB.Persons DROP PRIMARY KEY''')

0

In [27]:
# Return data from the Customers table:
cur.execute('''DESCRIBE testDB.Persons;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
columns = [i[0] for i in cur.description]
if len(df) == 0: df = pd.DataFrame([["" for i in range(len(columns))]])
df.columns = columns
df

       Field          Type Null Key Default Extra
0         ID       int(11)   NO        None
1   LastName  varchar(255)   NO        None
2  FirstName  varchar(255)  YES        None
3        Age       int(11)  YES        None

In [28]:
cur.execute('''ALTER TABLE testDB.Persons ADD CONSTRAINT PK_Person PRIMARY KEY (ID,LastName); ''')

0

In [36]:
# Return data from the Customers table:
cur.execute('''DESCRIBE testDB.Persons;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
columns = [i[0] for i in cur.description]
if len(df) == 0: df = pd.DataFrame([["" for i in range(len(columns))]])
df.columns = columns
df

       Field          Type Null  Key Default Extra
0         ID       int(11)   NO  PRI    None
1   LastName  varchar(255)   NO  PRI    None
2  FirstName  varchar(255)  YES         None
3        Age       int(11)  YES         None

In [29]:
cur.execute('''INSERT INTO testDB.Persons VALUES (1, 'Cooper', 'Álice', null); ''')

1

In [30]:
# Return data from the CustomersNew table:
cur.execute('''SELECT * FROM testDB.Persons;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
columns = [i[0] for i in cur.description]
if len(df) == 0: df = pd.DataFrame([["" for i in range(len(columns))]])
df.columns = columns
df

   ID LastName FirstName   Age
0   1   Cooper     Álice  None

In [31]:
cur.execute('''INSERT INTO testDB.Persons VALUES (1, 'Cooper', 'Álice', null); ''')

IntegrityError: (1062, "Duplicate entry '1-Cooper' for key 'PRIMARY'")

In [32]:
cur.execute('''INSERT INTO testDB.Persons VALUES (2, 'Cooper', 'Álice', null); ''')

1

In [33]:
# Return data from the CustomersNew table:
cur.execute('''SELECT * FROM testDB.Persons;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
columns = [i[0] for i in cur.description]
if len(df) == 0: df = pd.DataFrame([["" for i in range(len(columns))]])
df.columns = columns
df

   ID LastName FirstName   Age
0   1   Cooper     Álice  None
1   2   Cooper     Álice  None

In [34]:
cur.execute('''INSERT INTO testDB.Persons VALUES (2, 'AAA', 'BBB', null); ''')

1

In [35]:
# Return data from the CustomersNew table:
cur.execute('''SELECT * FROM testDB.Persons;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
columns = [i[0] for i in cur.description]
if len(df) == 0: df = pd.DataFrame([["" for i in range(len(columns))]])
df.columns = columns
df

   ID LastName FirstName   Age
0   1   Cooper     Álice  None
1   2      AAA       BBB  None
2   2   Cooper     Álice  None